In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("home_prices2.csv")

In [3]:
df

   area    price    city
0   200  2000000  mumbai
1   200  1000000  nagpur
2   300  2000000    pune
3   500  5200000  mumbai
4   300  1600000  nagpur
5   550  5600000  mumbai

In [4]:
from sklearn.preprocessing import LabelEncoder

In [5]:
le=LabelEncoder()

In [6]:
df["city_n"]=le.fit_transform(df["city"])

In [7]:
df

   area    price    city  city_n
0   200  2000000  mumbai       0
1   200  1000000  nagpur       1
2   300  2000000    pune       2
3   500  5200000  mumbai       0
4   300  1600000  nagpur       1
5   550  5600000  mumbai       0

In [8]:
df.drop("city",axis="columns",inplace=True)

In [9]:
df

   area    price  city_n
0   200  2000000       0
1   200  1000000       1
2   300  2000000       2
3   500  5200000       0
4   300  1600000       1
5   550  5600000       0

In [10]:
from sklearn.linear_model import LinearRegression

In [11]:
model=LinearRegression()

In [12]:
model.fit(df[["area","city_n"]],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [13]:
model.predict([[520,0]])

array([5298071.62534435])

In [14]:
#y=m1x1+m2*x2+b

In [15]:
model.coef_

array([  11184.57300275, -605234.15977961])

In [16]:
model.intercept_

-517906.33608815214

In [17]:
import pickle

In [18]:
with open("model1","wb") as f:
    pickle.dump(model,f)

In [19]:
import joblib

In [20]:
joblib.dump(model,"model2")

['model2']